Repository: ManimCommunity/manim
Catalog: docs/i18n/*/LC_MESSAGES/tutorials/quickstart.po
Languages: sv_se

source: Quickstart
sv_se: Snabbstart

source: This document will lead you step by step through the necessary procedure to get started with manim for the first time as soon as possible. This tutorial assumes you have already installed manim following the steps in :doc:`../installation`.
sv_se: Detta dokument kommer att leda dig steg för steg genom de nödvändiga stegen för att komma igång med manim för första gången. Den här övningen förutsätter att du redan har installerat manim efter stegen i :doc:`../installation`.

source: Start a new project
sv_se: Starta ett nytt projekt

source: To start a new manim video project, all you need to do is choose a single folder where all of the files related to the video will reside. For this example, this folder will be called ``project``,
sv_se: För att starta ett nytt manimvideoprojekt är allt du behöver göra att välja eller skapa en enda mapp där alla filer relaterade till videon kommer sparas. Till exempel kommer den här mappen att heta ``project``,

source: Every file containing code that produces a video with manim will be stored here, as well as any output files that manim produces and configuration files that manim needs.
sv_se: Varje fil som innehåller kod som genererar en video med manim kommer att lagras här, samt alla utdatafiler som manim producerar och konfigurationsfiler som manim behöver.

source: In case you like to work with Jupyterlab / Jupyter notebooks, there is good news: Manim ships with a ``%%manim`` IPython magic command which makes it easy to use in such a setting as well. Find out more in the :meth:`corresponding documentation <manim.utils.ipython_magic.ManimMagic.manim>`.
sv_se: Om du föredrar att arbeta med Jupyterlab / Jupyter notebooks så finns goda nyheter: Manim utges med ett ``%%manim`` IPython magic command som gör det enkelt att använda Manim i en sådan miljö också. Läs mer i :meth:`motsvarande dokumentation <manim.utils.ipython_magic.ManimMagic.manim>`.

source: Your first Scene
sv_se: Din första scen

source: To produce your first scene, create a new file in your project folder called ``scene.py``,
sv_se: För att producera din första scen skapar du en ny fil i din projektmapp som heter ``scene.py``,

source: and copy the following code in it.
sv_se: och klistra in följande kod in i den.

source: Then open your command line, navigate to your project directory, and execute the following command:
sv_se: Öppa sedan din command line, navigera till din projectkatalog och kör följande kommando:

source: After showing some output, manim should render the scene into a .mp4 file, and open that file with the default movie player application. You should see a video playing the following animation.
sv_se: Efter att ha visat lite utdata bör manim göra scenen till en .mp4 fil, samt öppna filen med din standard videospelare. Du bör se en video som spelar upp följande animation.

source: If you see the video and it looks correct, congrats! You just wrote your first manim scene from scratch. If you get an error message instead, or if do not see a video, or if the video output does not look like this, it is likely that manim has not been installed correctly. Please refer to the :doc:`../installation/troubleshooting` page for more information.
sv_se: Om du ser videon och den ser korrekt ut, grattis! Du har precis skrivit din första manimscen från grunden. Om du får ett felmeddelande istället, om du inte kan se en video eller om den producerade videon inte ser ut så här så är det troligt att manim inte har installerats korrekt. Se sidan :doc:`../installation/troubleshooting` för mer information.

source: Explanation
sv_se: Förklaring

source: Let's go line by line over the script we just executed to see how manim was able to generate the video.
sv_se: Låt oss gå rad för rad genom skriptet som vi just körde för att se hur manim kunde generera videon.

source: The first line
sv_se: Första raden

source: imports all of the contents of the library. This is the recommended way of using manim, as usually in a single script you will be using quite a few names from the manim namespace. In particular, this line includes all of the names used in the script: ``Scene``, ``Circle``, ``PINK`` and ``Create``.
sv_se: importerar allt innehåll i biblioteket. Detta är det rekommenderade sättet att använda manim eftersom du vanligtvis kommer att använda en hel del namn från manims namespace i ett enda skript. Speciellt innehåller den här raden alla namn som används i skriptet: ``Scene``, ``Circle``, ``PINK`` och ``Create``.

source: Now let's look at the next two lines.
sv_se: Nu kan vi titta på de nästa två raderna.

source: Most of the time, the code for scripting an animation with manim will go inside the :meth:`~.Scene.construct` method of a class that derives from :class:`.Scene`. Inside this method, you will create objects, display them on screen, and animate them.
sv_se: Merparten av tiden, kommer koden för att skripta en animation med manim att gå in i :meth:`~.Scene. onstruct` metoden av en klass som härstammar från :class:`.Scene`. Inuti denna metod kommer du att skapa objekt, visa dem på skärmen och animera dem.

source: The next two lines create a circle and set its color and opacity.
sv_se: De två nästkommande två raderna skapar en cirkel och anger dess färg och opacitet.

source: Finally, the last line uses the animation :class:`.Create` to display the circle on the screen.
sv_se: Slutligen använder den sista raden animationen :class:`.Create` för att visa cirkeln på skärmen.

source: Every animation must be contained within the :meth:`~.Scene.construct` method of a class that derives from :class:`.Scene`. Other code, for example auxiliary or mathematical functions, may reside outside the class.
sv_se: Varje animation måste finnas i :meth:`~.Scene.construct`-metoden i en klass som härstammar från :class:`.Scene`. Annan kod, till exempel hjälpfunktioner eller matematiska funktioner, får finnas utanför klassen.

source: Some bells and whistles
sv_se: Lite extra fint och glans

source: Our scene is a little basic, so let's add some bells and whistles. Modify the ``scene.py`` file to contain the following:
sv_se: Vår scen är lite platt och tråkig, så vi kan lägga till lite extra glans. Ändra filen ``scene.py`` så att den innehåller följande:

source: And render it using the following command:
sv_se: Och rendera den genom att använda följande kommando:

source: The output should look as follows.
sv_se: Utmatningen från skriptet bör se ut på följande sätt.

source: This example shows one of the most basic features of manim: the ability to implement complicated and mathematically intensive animations (such as cleanly interpolating between two geometric shapes) in very few lines of code.
sv_se: Detta exempel visar en av de mest grundläggande funktionerna hos manim: förmågan att genomföra komplicerade och matematiskt intensiva animationer (såsom att snyggt interpolera mellan två geometriska former) i mycket få rader av kod.

source: You're done!
sv_se: Du är klar!
