Repository: ManimCommunity/manim
Catalog: docs/i18n/*/LC_MESSAGES/installation.po
Languages: fr, sv

source: Installation
sv: Installering

source: Depending on your use case, different installation options are recommended: if you just want to play around with Manim for a bit, interactive in-browser notebooks are a really simple way of exploring the library as they require no local installation. Head over to https://try.manim.community to give our interactive tutorial a try.
fr: Suivant comment vous souhaitez utiliser Manim, différentes options d'installation s'offrent à vous : Si vous voulez simplement vous amuser avec, les bloc-notes interactifs sur votre navigateur sont un moyen simple d'explorer les possibilités offertes par la bibliothèque, puisqu'ils ne nécessitent pas d'installer quoi que ce soit sur votre ordinateur. Allez donc voir à l'adresse https://try.manim.community pour tester notre tutoriel interactif.
sv: Beroende på ditt användningsfall rekommenderas olika installationsalternativ: om du bara vill testa Manim först så är interaktiva notebooks lätta att utforska biblioteket med. De kan dessutom öppnas i din webbläsare utan att installera Manim lokalt vilket gör dem enkla att använda. Ta gärna en titt https://try.manim.community för en interaktiv nybörjarkurs.

source: Otherwise, if you intend to use Manim to work on an animation project, we recommend installing the library locally (either to your system's Python, or via Docker).
fr: Sinon, si vous souhaitez utiliser Manim pour travailler sur un projet d'animation, il vaut mieux installer la bibliothèque sur votre ordinateur (sur le Python de votre sytème, ou via Docker).
sv: Annars, om du har för avsikt att använda Manim för att jobba på ett animationsprojekt, så rekommenderar vi att du installerar biblioteket lokalt (antingen till ditt systems Python, eller via Docker).

source: Note that there are several different versions of Manim. The instructions on this website are **only** for the *community edition*. Find out more about the :doc:`differences between Manim versions <installation/versions>` if you are unsure which version you should install.
fr: Prenez garde, il y a plusieurs différentes versions de Manim. Les instructions sur ce site sont **seulement** pour la *version communautaire* (*community edition*). Découvrez en plus sur les :doc:`différences entre les versions de manim <installation/versions>` si vous n'êtes pas sûrs de quelle version installer.
sv: Observera att det finns flera olika versioner av Manim. Instruktionerna på denna webbsida är **endast** för *community-utgåvan*. Läs mer om :doc:`skillnader mellan Manim versioner <installation/versions>` om du är osäker på vilken version du bör installera.

source: :ref:`Installing Manim to your system's Python <local-installation>`
fr: :ref:`Installer Manim sur le Python de votre système <local-installation>`
sv: :ref:`Installera Manim till ditt systems Python <local-installation>`

source: :ref:`Using Manim via Docker <docker-installation>`
fr: :ref:`Utiliser Manim via Docker <docker-installation>`
sv: :ref:`Använda Manim via Docker <docker-installation>`

source: :ref:`Interactive Jupyter notebooks via Binder / Google Colab <interactive-online>`
fr: :ref:`Blocs-notes interactifs Jupyter via Binder / Google Colab <interactive-online>`
sv: :ref:`Interaktiva Jupyter notebooks via Binder / Google Colab <interactive-online>`

source: Installing Manim locally
fr: Installation de Manim sur l'ordinateur
sv: Installering av Manim lokalt

source: Manim is a Python library, and it can be `installed via pip <https://pypi.org/project/manim/>`__. However, in order for Manim to work properly, some additional system dependencies need to be installed first. The following pages have operating system specific instructions for you to follow.
fr: Manim est une bibliothèque Python, et peut donc être `installée avec pip <https://pypi.org/project/manim/>`__. Par contre, pour que Manim fonctionne correctement, quelques dépendances doivent être installées avant. Les pages suivantes offrent les instructions à suivre selon votre système d'exploitation.
sv: Manim är ett Pythonbibliotek, och det kan `installeras via pip <https://pypi.org/project/manim/>`__. För att Manim ska fungera ordentligt måste dock ytterligare systemberoenden installeras först. Följande sidor har operativsystemsspecifika instruktioner för dig att följa.

source: Depending on your particular setup, the installation process might be slightly different. Make sure that you have tried to follow the steps on the following pages carefully, but in case you hit a wall we are happy to help: either `join our Discord <https://www.manim.community/discord/>`__, or start a new Discussion `directly on GitHub <https://github.com/ManimCommunity/manim/discussions>`__.
fr: Suivant la configuration particulière de votre ordinateur, le processus d'installation peut varier légèrement. Assurez-vous d'avoir essayé de suivre avec attention les étapes sur les pages ci-dessous, mais si vous faites face à un problème, nous serons heureux de vous aider : vous pouvez `rejoindre notre serveur Discord <https://www.manim.community/discord/>`__, ou vous pouvez lancer une nouvelle Discussion `directement sur GitHub <https://github.com/ManimCommunity/manim/discussions>`__.
sv: Beroende på ditt specifika system så kan installationsprocessen vara något annorlunda. Se till att du har försökt att följa stegen på följande sidor noga, men om du träffar en vägg så hjälper vi gärna till: du kan antingen `gå med i vår Discord <https://www.manim.community/discord/>`__, eller starta en ny diskussion `direkt på GitHub <https://github.com/ManimCommunity/manim/discussions>`__.

source: Once Manim is installed locally, you can proceed to our :doc:`quickstart guide <tutorials/quickstart>` which walks you through rendering a first simple scene.
fr: Une fois que Manim est installé sur votre ordinateur, vous pouvez allez lire notre :doc:`guide de démarage rapide <tutorials/quickstart>` qui va vous apprendre à rendre une première scène simpliste.
sv: När Manim väl installerats lokalt så kan du fortsätta till vår :doc:`snabbstartsguide <tutorials/quickstart>` som visar dig hur du renderar din första enkla scen.

source: As mentioned above, do not worry if there are errors or other problems: consult our :doc:`troubleshooting guide <installation/troubleshooting>` for help, or get in touch with the community via `GitHub discussions <https://github.com/ManimCommunity/manim/discussions>`__ or `Discord <https://www.manim.community/discord/>`__.
fr: Comme indiqué ci-dessus, ne vous inquétez pas si vous rencontrez des erreurs ou autres problèmes : consultez notre :doc:`guide de dépannage <installation/troubleshooting>` pour obtenir de l'aide, sinon, prenez contact avec la communauté via `les discussions GitHub <https://github.com/ManimCommunity/manim/discussions>`__ ou via `Discord <https://www.manim.community/discord/>`__.
sv: Som nämnts ovan så behöver du inte oroa dig om det finns fel eller andra problem: läs vår :doc:`felsökningsguide <installation/troubleshooting>` för att få hjälp, eller ta kontakt med communityn via `GitHub-diskussioner <https://github.com/ManimCommunity/manim/discussions>`__ eller `Discord <https://www.manim.community/discord/>`__.

source: Using Manim via Docker
fr: Utiliser Manim via Docker
sv: Användning av Manim via Docker

source: `Docker <https://www.docker.com>`__ is a virtualization tool that allows the distribution of encapsulated software environments (containers).
fr: `Docker <https://www.docker.com>`__ est un outil de virtualisation qui permet la distribution de logiciels en environnement confiné (*containers*).
sv: `Docker <https://www.docker.com>`__ är ett virtualiseringsverktyg som gör det möjligt att distribuera inkapslade mjukvarumiljöer (containers).

source: The following pages contain more information about the docker image maintained by the community, ``manimcommunity/manim``:
fr: Les pages suivantes contiennent plus d'informations à propos de l'image docker maintenue par la communauté, ``manimcommunity/manim`` :
sv: Följande sidor innehåller mer information om den Docker Image som underhålls av communityn, ``manimcommunity/manim``:

source: Interactive Jupyter notebooks for your browser
fr: Bloc-notes interactifs Jupyter sur votre navigateur
sv: Interaktiva Jupyter notebooks för din webbläsare

source: Manim ships with a built-in ``%%manim`` IPython magic command designed for the use within `Jupyter notebooks <https://jupyter.org>`__. Our interactive tutorial over at https://try.manim.community illustrates how Manim can be used from within a Jupyter notebook.
fr: Le projet Manim contient une commande IPython ``%%manim`` prévue pour être utilisée dans des `blocs-notes Jupyter <https://jupyter.org>`__. Notre tutoriel interactif à l'adresse https://try.manim.community illustre la façon d'utiliser Manim dans un bloc-notes Jupyter.
sv: Manim ges ut med ett inbyggt ``%%manim`` IPython magic command som är utformat för användning inuti `Jupyter notebooks <https://jupyter.org>`__. Vår interaktiva nybörjarkurs på https://try.manim.community illustrerar hur Manim kan användas inuti en Jupyter notebook.

source: The following pages explain how you can setup interactive environments like that yourself:
fr: Les pages suivantes expliquent comment mettre en place de tels environnements interactifs vous-même :
sv: Följande sidor förklarar hur du kan skapa sådana interaktiva miljöer själv:

source: Installation for developers
fr: Installation pour les développeurs
sv: Installering för utvecklare
